Repository: AmirmLotfy/Tickdose
Catalog: lib/l10n/app_*.arb
Languages: ar

# termsOfServiceTitle
source: Terms of Service
ar: شروط الخدمة

# aboutTitle
source: About
ar: حول التطبيق

# aboutSubtitle
source: App version and information
ar: نسخة التطبيق والمعلومات

# helpSupportTitle
source: Help & Support
ar: المساعدة والدعم

# helpSupportSubtitle
source: FAQs and contact
ar: الأسئلة الشائعة والاتصال

# testCrashTitle
source: Test Crash
ar: تجربة الانهيار

# testCrashSubtitle
source: Force a crash (Dev only)
ar: فرض انهيار (للمطورين فقط)

# manageNotificationsSubtitle
source: Manage notification preferences
ar: إدارة تفضيلات الإشعارات

# readPrivacyPolicySubtitle
source: Read our privacy policy
ar: قراءة سياسة الخصوصية

# readTermsSubtitle
source: Read our terms of service
ar: قراءة شروط الخدمة

# showFavoritesTooltip
source: Show Favorites
ar: عرض المفضلة

# showAllTooltip
source: Show All
ar: عرض الكل

# noFavoritePharmacies
source: No favorite pharmacies found
ar: لم يتم العثور على صيدليات مفضلة

# timezoneUpdatedTitle
source: Timezone Updated
ar: تم تحديث المنطقة الزمنية

# timezoneUpdatedBody
source: Your reminders have been updated to {newTimezone}
ar: تم تحديث التذكيرات الخاصة بك إلى {newTimezone}

# logInTitle
source: Log In
ar: تسجيل الدخول

source: New here?
ar: جديد هنا؟

# createAccount
source: Create an Account
ar: إنشاء حساب

source: Or continue with
ar: أو تابع مع

# joinTickdo
source: Join Tickdose
ar: انضم إلى تيك دوز

# startManagingHealth
source: Start managing your health journey today.
ar: ابدأ إدارة رحلتك الصحية اليوم.

# rememberPassword
source: Remember your password?
ar: تذكرت كلمة المرور؟

source: Create new password
ar: إنشاء كلمة مرور جديدة

# passwordDifferent
source: Your new password must be different from previous used passwords.
ar: يجب أن تكون كلمة المرور الجديدة مختلفة عن كلمات المرور المستخدمة سابقاً.

source: New Password
ar: كلمة المرور الجديدة

source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة

source: Password requirements:
ar: متطلبات كلمة المرور:

source: At least 8 characters
ar: 8 أحرف على الأقل

# containsNumber
source: Contains a number
ar: يحتوي على رقم

# containsSymbol
source: Contains a symbol
ar: يحتوي على رمز

# passwordResetSuccess
source: Password reset successfully
ar: تم إعادة تعيين كلمة المرور بنجاح

# defineActiveHours
source: Define your active hours
ar: حدد ساعات نشاطك

# wakeWindowReminders
source: Tickdose will only send reminders during your wake window to sync with your circadian rhythm.
ar: سيقوم تيك دوس بإرسال التذكيرات فقط خلال نافذة الاستيقاظ الخاصة بك لمزامنة إيقاعك اليومي.

source: Wake Up
ar: الاستيقاظ

source: Bedtime
ar: وقت النوم

# continueButton
source: Continue
ar: متابعة

source: Routine Setup
ar: إعداد الروتين

source: Medical Background
ar: الخلفية الطبية

# aiAnalyzeSymptoms
source: This helps our AI analyze your symptoms more accurately and provide personalized insights.
ar: يساعد هذا الذكاء الاصطناعي لدينا في تحليل أعراضك بدقة أكبر وتقديم رؤى مخصصة.

# doYouHaveAllergies
source: Do you have any allergies?
ar: هل لديك أي حساسية؟

source: CURRENT TIME DETECTED
ar: الوقت الحالي المكتشف

source: Preferences
ar: التفضيلات

source: Privacy & Security
ar: الخصوصية والأمان

# deleteAccountConfirmation
source: Are you sure you want to delete your account? This action cannot be undone.
ar: هل أنت متأكد من أنك تريد حذف حسابك؟ لا يمكن التراجع عن هذا الإجراء.

source: Feeling unwell?
ar: تشعر بتوعك؟

# logSideEffectButton
source: Log Side Effect
ar: تسجيل أثر جانبي

source: Supply Tracking
ar: تتبع المخزون

source: Request Refill
ar: طلب إعادة التعبئة

source: Remaining
ar: المتبقي

# passwordWeak
source: Weak
ar: ضعيف

# passwordMedium
source: Medium
ar: متوسط

# passwordStrong
source: Strong
ar: قوي

# passwordVeryStrong
source: Very Strong
ar: قوي جداً

source: Medication Reminders
ar: تذكيرات الأدوية

source: Refill Alerts
ar: تنبيهات إعادة التعبئة

source: Health Analysis
ar: تحليل الصحة

source: Select Timezone
ar: اختر المنطقة الزمنية

# noKnownAllergies
source: I have no known allergies
ar: ليس لدي حساسيات معروفة

source: Chronic Conditions
ar: الحالات المزمنة

source: Log Taken
ar: تسجيل تناول الدواء

source: Interaction Warning
ar: تحذير التفاعل

source: No interactions detected
ar: لم يتم اكتشاف تفاعلات

source: Interactions Found
ar: تم العثور على تفاعلات

source: Proceed Anyway
ar: المتابعة على أي حال

# thisMedicineInteracts
source: This medicine interacts with your current medications
ar: هذا الدواء يتفاعل مع أدويتك الحالية

source: ACTIVE
ar: نشط

source: NEXT DOSE
ar: الجرعة التالية

source: No upcoming dose
ar: لا توجد جرعة قادمة

source: SYMPTOM CHECK
ar: فحص الأعراض

source: About this drug
ar: حول هذا الدواء

source: Read full monograph
ar: قراءة النشرة الكاملة

# monographTitle
source: {medicineName} Monograph
ar: نشرة {medicineName}

source: Close
ar: إغلاق

source: Edit Schedule
ar: تعديل الجدول

source: Edit Medicine
ar: تعديل الدواء

source: Share Medicine
ar: مشاركة الدواء

source: I Feel Assistant
ar: مساعد أشعر بـ

source: ONLINE
ar: متصل

source: ACTIVE CONTEXT
ar: السياق النشط

source: No active medications
ar: لا توجد أدوية نشطة

source: View Meds
ar: عرض الأدوية

source: I Feel AI
ar: ذكاء اصطناعي أشعر بـ

# describeSymptoms
source: Describe your symptoms to check for side effects
ar: صف أعراضك للتحقق من الآثار الجانبية

# logSymptom
source: Log "Dizziness"
ar: تسجيل "دوار"

source: Report Side Effect
ar: الإبلاغ عن أثر جانبي

source: Call Doctor
ar: اتصل بالطبيب

source: Patient
ar: المريض

source: HEART RATE
ar: معدل ضربات القلب

source: Voice Reminder
ar: تذكير صوتي

source: Record Nudge
ar: تسجيل تذكير

source: View Full List
ar: عرض القائمة الكاملة

# noRemindersToday
source: No reminders scheduled for today
ar: لا توجد تذكيرات مجدولة لليوم

source: Overdue
ar: متأخر

source: Pending
ar: قيد الانتظار

source: Pill List
ar: قائمة الأدوية

source: Refills
ar: إعادة التعبئة

# barcodeScanned
source: Barcode Scanned: {code}
ar: تم مسح الباركود: {code}

# noBarcodeFound
source: No barcode found in image
ar: لم يتم العثور على باركود في الصورة

source: Scan Barcode
ar: مسح الباركود

source: Select Unit
ar: اختر الوحدة

source: Schedule
ar: الجدول

# notifyLowStock
source: Notify when stock is low
ar: إشعار عند انخفاض المخزون

# translating
source: Translating... / جاري الترجمة...
ar: جاري الترجمة...

source: Scan Label
ar: مسح الملصق

source: Take Photo
ar: التقاط صورة

source: Upload
ar: رفع

source: Interaction Check Active
ar: فحص التفاعل نشط

source: Interactions
ar: التفاعلات

source: Monograph
ar: دليل الدواء

source: View Details
ar: عرض التفاصيل

source: Drops
ar: قطرات

source: Loading medicines...
ar: جاري تحميل الأدوية...

source: API key not configured
ar: مفتاح API غير مُكوّن

source: Loading schedule...
ar: جاري تحميل الجدول...

source: More
ar: المزيد

source: Reminder Schedule
ar: جدول التذكيرات

source: Inactive
ar: غير نشط

source: Your Privacy Matters
ar: خصوصيتك مهمة

# privacyPolicyIntro
source: At TICKDOSE, we are committed to protecting your personal information and your right to privacy.
ar: في تيك دوس، نحن ملتزمون بحماية معلوماتك الشخصية وحقك في الخصوصية.

# whatDataWeCollect
source: 1. What Data We Collect
ar: 1. البيانات التي نجمعها

# whatDataWeCollectContent
source: We collect information that you provide directly to us, including: • Medicines: Names, dosages, and schedules you add. • Reminders: Times and frequencies for your notifications. • Location: Used only when you access the Pharmacy Finder feature. • Health Profile: Conditions, allergies, and other health data you choose to save. • Usage Data: Anonymous analytics to help us improve the app.
ar: نجمع المعلومات التي تقدمها لنا مباشرة، بما في ذلك: • الأدوية: الأسماء والجرعات والجداول التي تضيفها. • التذكيرات: الأوقات والتكرارات لإشعاراتك. • الموقع: يُستخدم فقط عند الوصول إلى ميزة البحث عن الصيدلية. • الملف الصحي: الحالات والحساسيات وبيانات الصحة الأخرى التي تختار حفظها. • بيانات الاستخدام: تحليلات مجهولة المصدر لمساعدتنا على تحسين التطبيق.

# howWeUseYourData
source: 2. How We Use Your Data
ar: 2. كيفية استخدام بياناتك

# howWeUseYourDataContent
source: We use the information we collect to: • Send you timely medication reminders and notifications. • Track your medication adherence and provide statistics. • Improve app features and user experience. • Analyze usage patterns to fix bugs and enhance performance. • Comply with legal obligations.
ar: نستخدم المعلومات التي نجمعها من أجل: • إرسال تذكيرات وإشعارات الأدوية في الوقت المناسب. • تتبع التزامك بالأدوية وتقديم إحصائيات. • تحسين ميزات التطبيق وتجربة المستخدم. • تحليل أنماط الاستخدام لإصلاح الأخطاء وتحسين الأداء. • الامتثال للالتزامات القانونية.

# dataStorageSecurity
source: 3. Data Storage & Security
ar: 3. تخزين البيانات والأمان

# dataStorageSecurityContent
source: • All your personal data is stored securely in Google Firebase. • Data is encrypted in transit using HTTPS. • We implement robust security measures to protect your information. • We perform regular backups to prevent data loss. • We are committed to GDPR compliance and data protection standards.
ar: • جميع بياناتك الشخصية مخزنة بأمان في Google Firebase. • البيانات مشفرة أثناء النقل باستخدام HTTPS. • ننفذ إجراءات أمنية قوية لحماية معلوماتك. • نقوم بعمل نسخ احتياطية منتظمة لمنع فقدان البيانات. • نحن ملتزمون بالامتثال لـ GDPR ومعايير حماية البيانات.

# yourRights
source: 4. Your Rights
ar: 4. حقوقك

# yourRightsContent
source: You have the following rights regarding your data: • Access: You can view your data within the app at any time. • Export: You can request a copy of your data. • Deletion: You can delete your account and all associated data via the Settings menu. • Opt-out: You can opt-out of anonymous analytics tracking.
ar: لديك الحقوق التالية فيما يتعلق ببياناتك: • الوصول: يمكنك عرض بياناتك داخل التطبيق في أي وقت. • التصدير: يمكنك طلب نسخة من بياناتك. • الحذف: يمكنك حذف حسابك وجميع البيانات المرتبطة عبر قائمة الإعدادات. • إلغاء الاشتراك: يمكنك إلغاء الاشتراك في تتبع التحليلات المجهولة.

# thirdPartyServices
source: 5. Third-Party Services
ar: 5. خدمات الطرف الثالث

# thirdPartyServicesContent
source: We use trusted third-party services to operate the app: • Google & Apple: For secure authentication. • Firebase: For secure cloud database and storage. • Google Maps / OpenStreetMap: For the pharmacy finder feature. • Google Generative AI (Gemini): For the "I Feel" symptom checker and medication information enrichment (optional, can be disabled in settings).
ar: نستخدم خدمات طرف ثالث موثوقة لتشغيل التطبيق: • Google و Apple: للمصادقة الآمنة. • Firebase: لقاعدة البيانات السحابية الآمنة والتخزين. • Google Maps / OpenStreetMap: لميزة البحث عن الصيدلية. • Google Generative AI: لفحص الأعراض "أشعر بـ" (إذا تم تفعيله).

# contactUsPrivacy
source: 6. Contact Us
ar: 6. اتصل بنا

# contactUsPrivacyContent
source: If you have any questions about this Privacy Policy, please contact us at: Email: privacy@tickdose.app We take your privacy seriously and will respond to all inquiries promptly.
ar: إذا كان لديك أي أسئلة حول سياسة الخصوصية هذه، يرجى الاتصال بنا على: البريد الإلكتروني: privacy@tickdose.app نحن نأخذ خصوصيتك على محمل الجد وسنرد على جميع الاستفسارات على الفور.

# policyChanges
source: 7. Policy Changes
ar: 7. تغييرات السياسة

# policyChangesContent
source: We may update this privacy policy from time to time. We will notify you of any changes by posting the new privacy policy on this page and updating the "Last Updated" date.
ar: قد نحدث سياسة الخصوصية هذه من وقت لآخر. سنخطرك بأي تغييرات عن طريق نشر سياسة الخصوصية الجديدة على هذه الصفحة وتحديث تاريخ "آخر تحديث".

# lastUpdated
source: Last Updated: November 24, 2024
ar: آخر تحديث: 24 نوفمبر 2024

# sharePrivacyPolicyText
source: Check out Tickdose Privacy Policy: https://tickdosedemo.web.app/privacy-policy
ar: تحقق من سياسة خصوصية تيك دوس: https://tickdosedemo.web.app/privacy-policy

# sharePrivacyPolicySubject
source: Tickdose Privacy Policy
ar: سياسة خصوصية تيك دوس

source: Could not open privacy policy
ar: تعذر فتح سياسة الخصوصية

# termsOfServiceIntro
source: Please read these terms carefully before using the TICKDOSE application.
ar: يرجى قراءة هذه الشروط بعناية قبل استخدام تطبيق تيك دوس.

# licenseToUse
source: 1. License to Use
ar: 1. ترخيص الاستخدام

# licenseToUseContent
source: TICKDOSE grants you a personal, non-transferable, non-exclusive, revocable license to use the software for your personal, non-commercial use in accordance with these Terms. You own your personal data, but we retain all rights to the application code, design, and intellectual property.
ar: يمنحك تيك دوس ترخيصاً شخصياً وغير قابل للتحويل وغير حصري وقابل للإلغاء لاستخدام البرنامج لاستخدامك الشخصي وغير التجاري وفقاً لهذه الشروط. أنت تملك بياناتك الشخصية، لكننا نحتفظ بجميع الحقوق في كود التطبيق والتصميم والملكية الفكرية.

# restrictions
source: 2. Restrictions
ar: 2. القيود

# restrictionsContent
source: You agree not to: • Use the app for any illegal purpose. • Attempt to reverse engineer or decompile the app. • Share your account credentials with others. • Use the app to spam or harass others. • Attempt to breach the app's security measures.
ar: أنت توافق على عدم: • استخدام التطبيق لأي غرض غير قانوني. • محاولة عكس هندسة التطبيق أو فك تشفيره. • مشاركة بيانات اعتماد حسابك مع الآخرين. • استخدام التطبيق لإرسال رسائل غير مرغوب فيها أو مضايقة الآخرين. • محاولة اختراق إجراءات أمان التطبيق.

# medicalDisclaimer
source: 3. Medical Disclaimer
ar: 3. إخلاء المسؤولية الطبية

# medicalDisclaimerContent
source: ⚠️ TICKDOSE IS NOT A DOCTOR. • This app is not a substitute for professional medical advice, diagnosis, or treatment. • Never disregard professional medical advice or delay in seeking it because of something you have read on this app. • The data provided is for informational purposes only. • In case of a medical emergency, call your doctor or emergency services immediately. • We cannot diagnose, treat, or cure any condition.
ar: ⚠️ تيك دوس ليس طبيباً. • هذا التطبيق ليس بديلاً عن المشورة الطبية المهنية أو التشخيص أو العلاج. • لا تتجاهل أبداً المشورة الطبية المهنية أو تتأخر في طلبها بسبب شيء قرأته في هذا التطبيق. • البيانات المقدمة هي لأغراض إعلامية فقط. • في حالة الطوارئ الطبية، اتصل بطبيبك أو خدمات الطوارئ على الفور. • لا يمكننا تشخيص أو علاج أو شفاء أي حالة.

# userResponsibilities
source: 4. User Responsibilities
ar: 4. مسؤوليات المستخدم

# userResponsibilitiesContent
source: • You are responsible for the accuracy of the health data you enter. • You are responsible for maintaining the confidentiality of your account. • You agree to comply with all applicable laws and regulations. • You are solely liable for your use of the application.
ar: • أنت مسؤول عن دقة بيانات الصحة التي تدخلها. • أنت مسؤول عن الحفاظ على سرية حسابك. • أنت توافق على الامتثال لجميع القوانين واللوائح المعمول بها. • أنت المسؤول الوحيد عن استخدامك للتطبيق.

# limitationOfLiability
source: 5. Limitation of Liability
ar: 5. تحديد المسؤولية

# limitationOfLiabilityContent
source: To the maximum extent permitted by law, TICKDOSE shall NOT be liable for: • Any indirect, incidental, special, consequential, or punitive damages. • Any loss of data, use, goodwill, or other intangible losses. • Any missed doses or reminders due to technical failures. • Any adverse health outcomes resulting from reliance on the app. Our maximum liability is limited to the amount you paid for the app, if any.
ar: إلى أقصى حد يسمح به القانون، لن يكون تيك دوس مسؤولاً عن: • أي أضرار غير مباشرة أو عرضية أو خاصة أو تبعية أو عقابية. • أي فقدان للبيانات أو الاستخدام أو السمعة أو الخسائر غير الملموسة الأخرى. • أي جرعات فائتة أو تذكيرات بسبب الأعطال التقنية. • أي نتائج صحية سلبية ناتجة عن الاعتماد على التطبيق. مسؤوليتنا القصوى محدودة بمبلغ الذي دفعته للتطبيق، إن وجد.

# termination
source: 6. Termination
ar: 6. الإنهاء

# terminationContent
source: We reserve the right to terminate or suspend your account immediately, without prior notice or liability, for any reason whatsoever, including without limitation if you breach the Terms. Upon termination, your right to use the Service will immediately cease.
ar: نحتفظ بالحق في إنهاء أو تعليق حسابك فوراً، دون إشعار مسبق أو مسؤولية، لأي سبب كان، بما في ذلك على سبيل المثال لا الحصر إذا انتهكت الشروط. عند الإنهاء، سيتوقف حقك في استخدام الخدمة فوراً.

# changesToTerms
source: 7. Changes to Terms
ar: 7. تغييرات الشروط

# changesToTermsContent
source: We reserve the right to modify or replace these Terms at any time. By continuing to access or use our Service after those revisions become effective, you agree to be bound by the revised terms.
ar: نحتفظ بالحق في تعديل أو استبدال هذه الشروط في أي وقت. من خلال الاستمرار في الوصول إلى خدمتنا أو استخدامها بعد أن تصبح هذه المراجعات سارية، أنت توافق على الالتزام بالشروط المنقحة.

# contactUsTerms
source: 8. Contact Us
ar: 8. اتصل بنا

# contactUsTermsContent
source: If you have any questions about these Terms, please contact us at: Email: support@tickdose.app
ar: إذا كان لديك أي أسئلة حول هذه الشروط، يرجى الاتصال بنا على: البريد الإلكتروني: support@tickdose.app

# couldNotOpenTerms
source: Could not open terms of service
ar: تعذر فتح شروط الخدمة

# deleteAccountQuestion
source: Delete Account?
ar: حذف الحساب؟

# deleteAccountWarning
source: This action cannot be undone. All your medicines, reminders, tracking data, and account information will be permanently deleted.
ar: لا يمكن التراجع عن هذا الإجراء. سيتم حذف جميع أدويتك وتذكيراتك وبيانات التتبع ومعلومات الحساب بشكل دائم.

# deleteAccountPermanently
source: Permanently delete your account and all data
ar: حذف حسابك وجميع البيانات بشكل دائم

# accountDeletedSuccess
source: Account deleted successfully
ar: تم حذف الحساب بنجاح

# errorDeletingAccount
source: Error deleting account: {error}
ar: خطأ في حذف الحساب: {error}

# errorGeneric
source: An error occurred
ar: حدث خطأ

source: Delete
ar: حذف

source: Your personal medication reminder
ar: تذكيرك الشخصي للأدوية

source: FAQ
ar: الأسئلة الشائعة

# howToAddMedicine
source: How do I add a medicine?
ar: كيف أضيف دواء؟

# howToAddMedicineAnswer
source: Tap the + button on the home screen to add a new medicine.
ar: اضغط على زر + في الشاشة الرئيسية لإضافة دواء جديد.

# howToSetReminders
source: How do I set reminders?
ar: كيف أضبط التذكيرات؟

# howToSetRemindersAnswer
source: Go to Reminders tab and tap + to create a new reminder.
ar: انتقل إلى تبويب التذكيرات واضغط + لإنشاء تذكير جديد.

# canIEditMedicines
source: Can I edit my medicines?
ar: هل يمكنني تعديل أدويتي؟

# canIEditMedicinesAnswer
source: Yes, tap on any medicine to view details and tap Edit.
ar: نعم، اضغط على أي دواء لعرض التفاصيل واضغط تعديل.

source: Contact Support
ar: اتصل بالدعم

# version
source: Version 1.0.0
ar: الإصدار 1.0.0

source: Text
ar: نص

source: Voice
ar: صوت

source: History
ar: السجل

source: Emergency
ar: طوارئ

source: Create Invitation
ar: إنشاء دعوة

# selectAtLeastOnePermission
source: Please select at least one permission
ar: يرجى اختيار إذن واحد على الأقل

source: Relationship
ar: العلاقة

source: Permissions
ar: الأذونات

source: Permissions updated
ar: تم تحديث الأذونات

source: Family
ar: عائلة

source: Friend
ar: صديق

source: Nurse
ar: ممرض

source: Other
ar: آخر

source: Add Time
ar: إضافة وقت

# errorOccurred
source: Error: {error}
ar: خطأ: {error}

# barcodeLabel
source: Barcode: {code}
ar: الرمز الشريطي: {code}

# timesLabel
source: Times
ar: الأوقات

# doctorDisplayFormat
source: Dr. {name} ({specialization})
ar: د. {name} ({specialization})

# unitMg
source: mg
ar: ملغ

# unitG
source: g
ar: جم

# unitMl
source: ml
ar: مل

# unitUnits
source: units
ar: وحدات

# unitTablets
source: tablets
ar: أقراص

# unitCapsules
source: capsules
ar: كبسولات

# noKnownConflicts
source: No known conflicts with your current list.
ar: لا توجد تعارضات معروفة مع قائمتك الحالية.

# addMedicineTitle
source: Add Medicine
ar: إضافة دواء

# failedToUploadImage
source: Failed to upload image: {error}
ar: فشل رفع الصورة: {error}

# errorFailedToShare
source: Error: Failed to share: {error}
ar: خطأ: فشل المشاركة: {error}

# failedToDelete
source: Failed to delete: {error}
ar: فشل الحذف: {error}

source: Please log in to view side effects
ar: يرجى تسجيل الدخول لعرض الآثار الجانبية

# errorLoadingSideEffects
source: Error: {error}
ar: خطأ: {error}

# deleteSideEffectQuestion
source: Delete Side Effect?
ar: حذف الأثر الجانبي؟

# deleteSideEffectWarning
source: This action cannot be undone.
ar: لا يمكن التراجع عن هذا الإجراء.

source: Side effect deleted
ar: تم حذف الأثر الجانبي

# logSideEffectTitle
source: Log Side Effect
ar: تسجيل أثر جانبي

# sideEffectLoggedSuccess
source: Side effect logged successfully
ar: تم تسجيل الأثر الجانبي بنجاح

# effectNameLabel
source: Effect Name
ar: اسم الأثر

# effectNameHint
source: e.g., Nausea, Headache
ar: مثال: غثيان، صداع

source: When did this occur?
ar: متى حدث هذا؟

# notesOptionalLabel
source: Notes (optional)
ar: ملاحظات (اختياري)

# notesOptionalHint
source: Additional details about the side effect
ar: تفاصيل إضافية حول الأثر الجانبي

source: I understand the risks
ar: أفهم المخاطر

# searchMedicinesHint
source: Search medicines...
ar: البحث عن الأدوية...

# medsLabel
source: MEDS
ar: الأدوية

# plusOneToday
source: +1 today
ar: +1 اليوم

# adherencePercentage
source: {percentage}% adherence
ar: {percentage}% الالتزام

# xpToNextLevel
source: {xp} XP to Level {level}
ar: {xp} نقطة إلى المستوى {level}

source: No chat history yet
ar: لا يوجد تاريخ محادثة بعد

source: No patients found
ar: لم يتم العثور على مرضى

source: No logs for this day
ar: لا توجد سجلات لهذا اليوم

# errorOccurredMessage
source: An error occurred
ar: حدث خطأ

# errorWithMessage
source: Error: {error}
ar: خطأ: {error}

source: Something went wrong
ar: حدث خطأ ما

# errorRecoveryMessage
source: We're sorry, but an error occurred. The app will try to recover automatically.
ar: نأسف، لكن حدث خطأ. سيحاول التطبيق الاستعادة تلقائياً.

source: Try Again
ar: حاول مرة أخرى

source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح

source: Enable Location Services
ar: تفعيل خدمات الموقع

# locationServicesDescription
source: Find nearby pharmacies and get location-based reminders
ar: ابحث عن الصيدليات القريبة واحصل على تذكيرات مبنية على الموقع

# locationServicesDetailedDescription
source: We use your location to help you find the nearest pharmacies and provide accurate medication reminders based on your location.
ar: نستخدم موقعك لمساعدتك في العثور على أقرب الصيدليات وتقديم تذكيرات دقيقة للأدوية بناءً على موقعك.

source: Enable Camera Access
ar: تفعيل الوصول إلى الكاميرا

# cameraAccessDescription
source: Scan medication labels and capture health information
ar: امسح ملصقات الأدوية والتقط معلومات صحية

source: Enable Microphone Access
ar: تفعيل الوصول إلى الميكروفون

# microphoneAccessDescription
source: Use voice commands and record symptoms
ar: استخدم الأوامر الصوتية وسجل الأعراض

# youCanChangeAnytimeInSettings
source: You can change this anytime in Settings
ar: يمكنك تغيير هذا في أي وقت في الإعدادات

source: Not Now
ar: ليس الآن

source: Allow
ar: السماح

source: Today
ar: اليوم

source: Yesterday
ar: أمس

source: No activity for this date
ar: لا يوجد نشاط في هذا التاريخ

# errorTitle
source: Error
ar: خطأ

source: Page not found
ar: الصفحة غير موجودة

# todayAt
source: Today, {time}
ar: اليوم، {time}

source: Missed Medication Alert
ar: تنبيه جرعة فائتة

# patientMissedMedicationAt
source: {patientOrUser} missed {medicineName} at {time}
ar: فوت {patientOrUser} {medicineName} في الساعة {time}

source: User
ar: المستخدم

# adherenceSummaryTitle
source: {type} Adherence Summary
ar: ملخص الالتزام {type}

# adherenceSummaryBody
source: Adherence: {rate}% | Taken: {taken} | Missed: {missed} | Skipped: {skipped}
ar: الالتزام: {rate}% | متناول: {taken} | فائت: {missed} | متخطى: {skipped}

source: Side Effect Alert
ar: تنبيه أثر جانبي

source: URGENT Health Concern
ar: مشكلة صحية عاجلة

source: Health Concern Alert
ar: تنبيه مشكلة صحية

source: No reminders set
ar: لم يتم تعيين تذكيرات
