Repository: AmirmLotfy/Tickdose
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: TICKDOSE
ar: تيك دوس

# yesAction
source: Yes
ar: نعم

# noAction
source: No
ar: لا

# refillReminderTitle
source: Refill Reminder
ar: تذكير إعادة التعبئة

# refillReminderBody
source: It's time to refill your {medicineName}.
ar: حان وقت إعادة تعبئة {medicineName}.

source: Home
ar: الرئيسية

source: Reminders
ar: التذكيرات

source: Tracking
ar: المتابعة

source: Pharmacy
ar: الصيدلية

source: Profile
ar: الملف الشخصي

source: Settings
ar: الإعدادات

source: Language
ar: اللغة

# settingsLanguage
source: Language
ar: اللغة

# settingsSoundEffects
source: Sound Effects
ar: تأثيرات صوتية

# settingsNotifications
source: Notifications
ar: الإشعارات

# settingsDarkMode
source: Dark Mode
ar: الوضع الداكن

# settingsTitle
source: Settings
ar: الإعدادات

# onboardingTitle1
source: Never Miss Your Medicine
ar: لا تفوت موعد دوائك أبداً

# onboardingDesc1
source: Get timely reminders for all your medications and keep your health on track.
ar: احصل على تذكيرات في الوقت المناسب لجميع أدويتك وحافظ على صحتك في المسار الصحيح.

# onboardingTitle2
source: Track Your Adherence
ar: تتبع التزامك

# onboardingDesc2
source: Monitor your progress with detailed statistics and history logs.
ar: راقب تقدمك باستخدام إحصائيات مفصلة وسجلات التاريخ.

# onboardingTitle3
source: Find Nearby Pharmacies
ar: اعثر على الصيدليات القريبة

# onboardingDesc3
source: Locate the nearest pharmacies and check their availability instantly.
ar: حدد موقع أقرب الصيدليات وتحقق من توفرها فوراً.

source: Get Started
ar: ابدأ الآن

source: Skip
ar: تخطي

source: Next
ar: التالي

# splashTagline
source: Never Miss Your Medicine
ar: لا تفوت موعد دوائك أبداً

# reminderTitle
source: Time to take your medicine
ar: حان وقت تناول الدواء

# reminderBody
source: Take {medicineName} now.
ar: تناول {medicineName} الآن.

# voiceReminderStandard
source: It's time to take {dosage} of {medicineName}. Please take your medication now to stay on track with your health goals.
ar: حان وقت تناول {dosage} من {medicineName}. يرجى تناول دوائك الآن للحفاظ على صحتك.

# voiceReminderMeal
source: It's {mealTime} time! Take {dosage} of {medicineName} WITH FOOD. Please take your medication now to stay on track with your health goals.
ar: إنه وقت {mealTime}! تناول {dosage} من {medicineName} مع الطعام. يرجى تناول دوائك الآن للحفاظ على صحتك.

source: Good morning!
ar: صباح الخير!

source: Good afternoon!
ar: طاب مساؤك!

source: Good evening!
ar: مساء الخير!

source: Hello!
ar: مرحباً!

# medicineDetailsTitle
source: Medicine Details
ar: تفاصيل الدواء

# deleteMedicineTitle
source: Delete Medicine
ar: حذف الدواء

# deleteMedicineQuestion
source: Delete Medicine?
ar: حذف الدواء؟

# deleteMedicineContent
source: This action cannot be undone.
ar: لا يمكن التراجع عن هذا الإجراء.

# dialogCancel
source: Cancel
ar: إلغاء

# dialogDelete
source: Delete
ar: حذف

# tabDetails
source: Details
ar: التفاصيل

# tabSideEffects
source: Side Effects
ar: الآثار الجانبية

# tabInteractions
source: Interactions
ar: تفاعلات الأدوية

source: Log Side Effect
ar: تسجيل أثر جانبي

source: Generic: {name}
ar: الاسم العلمي: {name}

source: Image not available
ar: الصورة غير متوفرة

# dosageInfo
source: Dosage Information
ar: معلومات الجرعة

# strengthLabel
source: Strength (Optional)
ar: القوة (اختياري)

# formLabel
source: Form
ar: الشكل الصيدلاني

# dosageLabel
source: Dosage
ar: الجرعة

# frequencyLabel
source: Frequency
ar: التكرار

source: Manufacturer Info
ar: الشركة المصنعة

# manufacturerLabel
source: Manufacturer:
ar: الشركة المصنعة:

source: Prescription Details
ar: تفاصيل الوصفة

source: Known Side Effects
ar: الآثار الجانبية المعروفة

# remindersLabel
source: Reminders
ar: التذكيرات

# refillReminderLabel
source: Refill Reminder
ar: تذكير إعادة التعبئة

# notesLabel
source: Notes
ar: ملاحظات

# expiringSoonWarning
source: This medicine is expiring soon!
ar: هذا الدواء سينتهي قريباً!

# expiredWarning
source: This medicine has expired!
ar: هذا الدواء منتهي الصلاحية!

# interactionsTitle
source: Medicine Interactions
ar: التفاعلات الدوائية

# noInteractions
source: No known interactions found.
ar: لا توجد تفاعلات معروفة.

source: Health Profile Check
ar: فحص الملف الصحي

# safeForHealth
source: Safe for your health profile
ar: آمن بالنسبة لملفك الصحي

# foodInteractionsTitle
source: Food Interactions
ar: تفاعلات الطعام

# noFoodInteractions
source: No known food interactions.
ar: لا توجد تفاعلات طعام معروفة.

# myMedicinesTitle
source: My Medicines
ar: أدويتي

# noMedicinesAdded
source: No medicines added yet
ar: لم تتم إضافة أدوية بعد

# helloUser
source: Hello, {name}
ar: مرحباً، {name}

# homeTagline
source: Let's stay healthy today!
ar: لنحافظ على صحتك اليوم!

source: Today's Medicines
ar: أدوية اليوم

source: See All
ar: عرض الكل

# noMedicinesToday
source: No medicines scheduled for today
ar: لا توجد أدوية مجدولة لليوم

source: Add Reminder
ar: إضافة تذكير

source: Edit Reminder
ar: تعديل تذكير

source: Error loading reminders
ar: خطأ في تحميل التذكيرات

# markedAsTaken
source: ✓ Marked {medicine} as taken
ar: ✓ تم تحديد {medicine} كـ مأخوذ

source: Skipped {medicine}
ar: تخطي {medicine}

# takeAction
source: Take
ar: تناول

# skipAction
source: Skip
ar: تخطي

# adherenceLabel
source: Adherence
ar: الالتزام

# streakLabel
source: STREAK
ar: السلسلة

# streakDays
source: {days} days
ar: {days} أيام

# iFeelTitle
source: I Feel
ar: أشعر بـ

# iFeelSubtitle
source: Check symptoms - Text or Voice
ar: افحص الأعراض - نص أو صوت

# trackingTitle
source: Tracking
ar: تتبع

# analyzingReport
source: Generating PDF report...
ar: جاري إنشاء تقرير PDF...

# reportSuccess
source: PDF report generated successfully!
ar: تم إنشاء التقرير بنجاح!

# reportError
source: Error generating PDF: {error}
ar: خطأ في إنشاء التقرير: {error}

# historyTitle
source: History
ar: السجل

# profileTitle
source: Profile
ar: الملف الشخصي

source: Edit Profile
ar: تعديل الملف الشخصي

# notificationsLabel
source: Notifications
ar: الإشعارات

# notificationsSubtitle
source: Receive medication reminders
ar: استلام تذكيرات الدواء

# languageLabel
source: Language
ar: اللغة

# privacyPolicyLabel
source: Privacy Policy
ar: سياسة الخصوصية

# darkModeLabel
source: Dark Mode
ar: الوضع الداكن

# darkModeSubtitle
source: Use dark theme
ar: استخدام المظهر الداكن

# accountTitle
source: Account
ar: الحساب

# caregiversLabel
source: Caregivers
ar: مقدمو الرعاية

# acceptInvitationLabel
source: Accept Invitation
ar: قبول دعوة

# changePasswordLabel
source: Change Password
ar: تغيير كلمة المرور

# deleteAccountLabel
source: Delete Account
ar: حذف الحساب

# logoutLabel
source: Log Out
ar: تسجيل الخروج

# findPharmacyTitle
source: Find Pharmacy
ar: ابحث عن صيدلية

source: Location Access Required
ar: مطلوب إذن الموقع

# locationAccessRationale
source: Enable location services to find nearby pharmacies
ar: قم بتفعيل خدمات الموقع للعثور على الصيدليات القريبة

# enableLocationAction
source: Enable Location
ar: تفعيل الموقع

# pharmacyError
source: Error: {error}
ar: خطأ: {error}

# noPharmaciesFound
source: No pharmacies found nearby
ar: لم يتم العثور على صيدليات قريبة

# pharmaciesFoundCount
source: {count} found
ar: {count} صيدلية

# directionsAction
source: Directions
ar: الاتجاهات

# callAction
source: Call
ar: اتصال

# websiteAction
source: Website
ar: الموقع الإلكتروني

# showMapAction
source: Show Map
ar: عرض الخريطة

# showListAction
source: Show List
ar: عرض القائمة

# myDoctorsTitle
source: My Doctors
ar: أطبائي

# addDoctorTitle
source: Add Doctor
ar: إضافة دكتور

# deleteDoctorTitle
source: Delete Doctor?
ar: حذف الدكتور؟

# deleteDoctorContent
source: Are you sure you want to remove this doctor from your list?
ar: هل أنت متأكد أنك تريد إزالة هذا الدكتور من قائمتك؟

# cancelButton
source: Cancel
ar: إلغاء

# deleteButton
source: Delete
ar: حذف

source: Please log in
ar: يرجى تسجيل الدخول

# noDoctorsAdded
source: No doctors added yet
ar: لم يتم إضافة أطباء بعد

# tapToAddDoctor
source: Tap "Add Doctor" to get started
ar: اضغط على "إضافة دكتور" للبدء

# doctorNameLabel
source: Doctor Name
ar: اسم الدكتور

# doctorNameHint
source: e.g. Dr. Smith
ar: مثال: د. أحمد

# doctorNameRequired
source: Please enter a name
ar: يرجى إدخال الاسم

# specializationLabel
source: Specialization
ar: التخصص

# specializationRequired
source: Please select a specialization
ar: يرجى اختيار التخصص

# phoneNumberLabel
source: Phone Number
ar: رقم الهاتف

# phoneRequired
source: Please enter a valid phone number
ar: يرجى إدخال رقم هاتف صحيح

# doctorAddedSuccess
source: Doctor added successfully
ar: تم إضافة الدكتور بنجاح

# doctorAddError
source: Error adding doctor: {error}
ar: خطأ في إضافة الدكتور: {error}

# specializationGeneral
source: General Practitioner
ar: طبيب عام

# specializationCardiologist
source: Cardiologist
ar: طبيب قلب

# specializationDermatologist
source: Dermatologist
ar: طبيب جلدية

# specializationNeurologist
source: Neurologist
ar: طبيب أعصاب

# specializationPsychiatrist
source: Psychiatrist
ar: طبيب نفسي

# specializationEndocrinologist
source: Endocrinologist
ar: طبيب غدد صماء

# specializationPediatrician
source: Pediatrician
ar: طبيب أطفال

# specializationSurgeon
source: Surgeon
ar: جراح

# specializationDentist
source: Dentist
ar: طبيب أسنان

# specializationOther
source: Other
ar: آخر

# caregiverDashboardTitle
source: Caregiver Dashboard
ar: لوحة تحكم مقدم الرعاية

# patientMedicationsTitle
source: Patient Medications
ar: أدوية المريض

source: Read-only view
ar: عرض للقراءة فقط

# todaysMedicationsTitle
source: Today''s Medications
ar: أدوية اليوم

# noMedicationsToday
source: No medications scheduled for today
ar: لا توجد أدوية مجدولة لليوم

# sendVoiceReminderTooltip
source: Send voice reminder
ar: إرسال تذكير صوتي

source: Voice reminder sent
ar: تم إرسال التذكير الصوتي

# allMedicationsTitle
source: All Medications
ar: كل الأدوية

source: No medications added
ar: لم يتم إضافة أدوية

# errorLabel
source: Error: {error}
ar: خطأ: {error}

# acceptInvitationTitle
source: Accept Invitation
ar: قبول الدعوة

# invitationCodeLabel
source: Invitation Code
ar: رمز الدعوة

# enterInvitationCodePrompt
source: Enter 64-character code
ar: أدخل الرمز المكون من 64 حرفاً

# invitationCodeInputLabel
source: Enter Invitation Code
ar: أدخل رمز الدعوة

# invitationCodeInputDescription
source: Enter the invitation code you received from the patient to become their caregiver.
ar: أدخل رمز الدعوة الذي استلمته من المريض لتصبح مقدم رعاية له.

# validateCodeButton
source: Validate Code
ar: التحقق من الرمز

# acceptInvitationButton
source: Accept Invitation
ar: قبول الدعوة

# declineButton
source: Decline
ar: رفض

# pleaseLogInToAccept
source: Please log in first to accept an invitation
ar: يرجى تسجيل الدخول أولاً لقبول الدعوة

# invitationAcceptedSuccess
source: Invitation accepted successfully!
ar: تم قبول الدعوة بنجاح!

# invitationAcceptedView
source: Invitation accepted! You can now view patient medications.
ar: تم قبول الدعوة! يمكنك الآن عرض أدوية المريض.

# invitationFailed
source: Failed to accept invitation. Code may be invalid or expired.
ar: فشل قبول الدعوة. قد يكون الرمز غير صالح أو منتهي الصلاحية.

# invitationError
source: Error accepting invitation. Please try again.
ar: خطأ في قبول الدعوة. يرجى المحاولة مرة أخرى.

# invalidInvitationFormat
source: Invalid invitation code format
ar: صيغة رمز الدعوة غير صالحة

# invitationNotFound
source: Invitation code not found
ar: رمز الدعوة غير موجود

# invitationUsed
source: This invitation has already been used
ar: تم استخدام هذه الدعوة مسبقاً

# invitationExpired
source: This invitation has expired
ar: انتهت صلاحية هذه الدعوة

# loginRequiredNote
source: Note: You need to be logged in to accept an invitation.
ar: ملاحظة: يجب أن تكون مسجلاً للدخول لقبول الدعوة.

# howToFindCodeTitle
source: How to find your invitation code:
ar: كيف تجد رمز الدعوة الخاص بك:

# howToFindCodeStep1
source: 1. Ask the patient to share the invitation code
ar: 1. اطلب من المريض مشاركة رمز الدعوة

# howToFindCodeStep2
source: 2. Or scan the QR code they provided
ar: 2. أو امسح رمز الاستجابة السريعة (QR) الذي قدموه

# howToFindCodeStep3
source: 3. Enter the code in the field above
ar: 3. أدخل الرمز في الحقل أعلاه

# invalidInvitationTitle
source: Invalid Invitation
ar: دعوة غير صالحة

# invalidInvitationMessage
source: This invitation is invalid or has expired.
ar: هذه الدعوة غير صالحة أو منتهية الصلاحية.

# invitationUsedTitle
source: Invitation Used
ar: الدعوة مستخدمة

# invitationUsedMessage
source: This invitation has already been used.
ar: تم استخدام هذه الدعوة بالفعل.

# invitedTitle
source: You've been invited!
ar: لقد تمت دعوتك!

# invitedMessage
source: You've been invited to help manage medications.
ar: لقد تمت دعوتك للمساعدة في إدارة الأدوية.

# permissionsTitle
source: You will have access to:
ar: سيكون لديك صلاحية الوصول إلى:

# invitationLinkCopied
source: Invitation link copied to clipboard
ar: تم نسخ رابط الدعوة إلى الحافظة

# invitationCodeCopied
source: Invitation code copied to clipboard
ar: تم نسخ رمز الدعوة إلى الحافظة

# shareInvitationText
source: You've been invited to be a caregiver on Tickdose! Click here to accept: {url} Or enter this code in the app: {token}
ar: لقد تمت دعوتك لتكون مقدم رعاية على Tickdose! انقر هنا للقبول: {url} أو أدخل هذا الرمز في التطبيق: {token}

# shareInvitationSubject
source: Caregiver Invitation from Tickdose
ar: دعوة مقدم رعاية من Tickdose

# errorSharing
source: Error sharing: {error}
ar: خطأ في المشاركة: {error}

# invitationTitle
source: Invitation
ar: دعوة

# shareInvitationTitle
source: Share Invitation
ar: مشاركة الدعوة

# shareInvitationSubtitle
source: Share this invitation with {email}
ar: شارك هذه الدعوة مع {email}

# scanQrCodeTitle
source: Scan QR Code
ar: مسح رمز QR

# scanQrCodeDescription
source: Caregiver can scan this QR code with their phone camera or Tickdose app
ar: يمكن لمقدم الرعاية مسح هذا الرمز بكاميرا الهاتف أو تطبيق Tickdose

# invitationLinkTitle
source: Invitation Link
ar: رابط الدعوة

# copyLinkTooltip
source: Copy link
ar: نسخ الرابط

# ifQrNotWorking
source: If QR code doesn't work, caregiver can enter this code manually:
ar: إذا لم يعمل رمز QR، يمكن لمقدم الرعاية إدخال الرمز يدوياً:

# copyCodeTooltip
source: Copy code
ar: نسخ الرمز

# shareInvitationButton
source: Share Invitation
ar: مشاركة الدعوة

# howToShareTitle
source: How to share:
ar: كيفية المشاركة:

# howToShareStep1Title
source: 1. Show QR code to caregiver
ar: 1. اعرض رمز QR لمقدم الرعاية

# howToShareStep1Desc
source: They can scan it with their phone camera
ar: يمكنهم مسحه بكاميرا هواتفهم

# howToShareStep2Title
source: 2. Share the link
ar: 2. شارك الرابط

# howToShareStep2Desc
source: Send via message, email, or any messaging app
ar: أرسل عبر الرسائل أو البريد الإلكتروني أو أي تطبيق مراسلة

# howToShareStep3Title
source: 3. Share the code
ar: 3. شارك الرمز

# howToShareStep3Desc
source: Caregiver can enter the code manually in the app
ar: يمكن لمقدم الرعاية إدخال الرمز يدوياً في التطبيق

source: Microphone permission required
ar: إذن الميكروفون مطلوب

# recordingError
source: Error starting recording: {error}
ar: خطأ في بدء التسجيل: {error}

source: Voice message saved!
ar: تم حفظ الرسالة الصوتية!

# recordVoiceMessageTitle
source: Record Voice Message
ar: تسجيل رسالة صوتية

# voiceMessageFor
source: Voice Message for {medicineName}
ar: رسالة صوتية لـ {medicineName}

# recordVoiceMessageDescription
source: Record a personal voice reminder (up to 15 seconds)
ar: سجل تذكيراً صوتياً شخصياً (مجرد 15 ثانية كحد أقصى)

# startRecordingButton
source: Start Recording
ar: بدء التسجيل

# stopRecordingButton
source: Stop Recording
ar: إيقاف التسجيل

# saveVoiceMessageButton
source: Save Voice Message
ar: حفظ الرسالة الصوتية

# generatingPdfMessage
source: Generating PDF report for {month}...
ar: جاري إنشاء تقرير PDF لشهر {month}...

# pdfGeneratedSuccess
source: Report generated! Saved to {path}
ar: تم إنشاء التقرير! محفوظ في {path}

# pdfGenerationError
source: Error generating report: {error}
ar: خطأ في إنشاء التقرير: {error}

# exportPdfButton
source: Export PDF Report
ar: تصدير تقرير PDF

source: User data not available
ar: بيانات المستخدم غير متوفرة

source: Welcome Back!
ar: مرحباً بعودتك!

# signInContinue
source: Sign in to continue
ar: سجل الدخول للمتابعة

# emailLabel
source: Email
ar: البريد الإلكتروني

# emailValidation
source: Please enter your email
ar: الرجاء إدخال البريد الإلكتروني

# passwordLabel
source: Password
ar: كلمة المرور

# passwordValidation
source: Please enter your password
ar: الرجاء إدخال كلمة المرور

# forgotPasswordButton
source: Forgot Password?
ar: نسيت كلمة المرور؟

# loginButton
source: Login
ar: تسجيل الدخول

# continueGoogle
source: Continue with Google
ar: المتابعة باستخدام Google

# continueApple
source: Continue with Apple
ar: المتابعة باستخدام Apple

source: Use Biometric Login
ar: استخدام الدخول بالبصمة

# biometricNotAvailable
source: Biometric authentication not available on this device
ar: المصادقة البيومترية غير متوفرة على هذا الجهاز

# biometricEnablePrompt
source: Please login normally first to enable biometric login
ar: يرجى تسجيل الدخول بشكل طبيعي أولاً لتفعيل الدخول بالبصمة

# biometricAuthFailed
source: Biometric authentication failed
ar: فشلت المصادقة البيومترية

# biometricLoginFailed
source: Biometric login failed: {error}
ar: فشل الدخول بالبصمة: {error}

# noAccountPrompt
source: Don't have an account?
ar: ليس لديك حساب؟

# signUpButton
source: Sign Up
ar: إنشاء حساب

# createAccountTitle
source: Create Account
ar: إنشاء حساب

# nameLabel
source: Name
ar: الاسم

# confirmPasswordLabel
source: Confirm Password
ar: تأكيد كلمة المرور

# alreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟

# signInButton
source: Sign In
ar: تسجيل الدخول

# startJourneySubtitle
source: Start your journey to better health
ar: ابدأ رحلتك نحو صحة أفضل

# termsAgreementValidation
source: Please agree to the Terms of Service and Privacy Policy
ar: يرجى الموافقة على شروط الخدمة وسياسة الخصوصية

# registrationSuccess
source: Registration successful! Please verify your email.
ar: تم التسجيل بنجاح! يرجى التحقق من بريدك الإلكتروني.

# nameHint
source: Enter your full name
ar: أدخل اسمك الكامل

# nameValidation
source: Please enter your name
ar: الرجاء إدخال الاسم

# emailHint
source: Enter your email
ar: أدخل بريدك الإلكتروني

# emailInvalid
source: Please enter a valid email
ar: الرجاء إدخال بريد إلكتروني صالح

# passwordHint
source: Create a strong password
ar: أدخل كلمة مرور قوية

# passwordEmpty
source: Please enter a password
ar: الرجاء إدخال كلمة المرور

# confirmPasswordHint
source: Confirm your password
ar: تأكيد كلمة المرور

source: Passwords do not match
ar: كلمات المرور غير متطابقة

# termsAgreementPrefix
source: I agree to the
ar: أوافق على

source: Terms of Service
ar: شروط الخدمة

# termsAgreementAnd
source: and
ar: و

source: Privacy Policy
ar: سياسة الخصوصية

# orSeparator
source: OR
ar: أو

# loginLink
source: Login
ar: تسجيل الدخول

# forgotPasswordTitle
source: Forgot Password
ar: نسيت كلمة المرور

# forgotPasswordSubtitle
source: Enter your email to receive a password reset link
ar: أدخل بريدك الإلكتروني لاستلام رابط إعادة تعيين كلمة المرور

# sendResetLinkButton
source: Send Reset Link
ar: إرسال الرابط

# passwordResetSent
source: Password reset email sent! Please check your inbox.
ar: تم إرسال رابط إعادة تعيين كلمة المرور! يرجى التحقق من بريدك الإلكتروني.

# resetPasswordButton
source: Reset Password
ar: إعادة تعيين كلمة المرور

# emailVerifiedSuccess
source: Email verified successfully!
ar: تم التحقق من البريد الإلكتروني بنجاح!

# emailNotVerifiedYet
source: Email not verified yet. Please check your inbox.
ar: لم يتم التحقق من البريد الإلكتروني بعد. يرجى التحقق من بريدك.

# resendEmailButton
source: Resend Email
ar: إعادة إرسال البريد الإلكتروني

# verificationEmailSent
source: Verification email sent! Please check your inbox.
ar: تم إرسال بريد التحقق! يرجى التحقق من بريدك الإلكتروني.

# verifyEmailTitle
source: Verify Your Email
ar: تحقق من بريدك الإلكتروني

# verifyEmailSubtitle
source: We have sent a verification link to your email address. Please verify to continue.
ar: لقد أرسلنا رابط التحقق إلى عنوان بريدك الإلكتروني. يرجى التحقق للمتابعة.

# iHaveVerifiedButton
source: I have verified
ar: لقد قمت بالتحقق

# speechNotAvailable
source: Speech recognition not available
ar: خدمة التعرف على الصوت غير متوفرة

# tapToAddImage
source: Tap to add medicine image
ar: اضغط لإضافة صورة الدواء

# cameraLabel
source: Camera
ar: الكاميرا

# galleryLabel
source: Gallery
ar: المعرض

# medicineNameLabel
source: Medicine Name
ar: اسم الدواء

# medicineNameHint
source: Enter medicine name
ar: أدخل اسم الدواء

# medicineNameRequired
source: Please enter medicine name
ar: يرجى إدخال اسم الدواء

# strengthHint
source: e.g., 500mg
ar: مثال: 500 ملغ

# dosageHint
source: e.g., 1 tablet
ar: مثال: 1 قرص

# dosageRequired
source: Please enter dosage
ar: يرجى إدخال الجرعة

# formHint
source: Select form
ar: اختر الشكل

# frequencyHint
source: Select frequency
ar: اختر التكرار

# prescribingDoctorLabel
source: Prescribing Doctor (Optional)
ar: الدكتور المعالج (اختياري)

# noneOption
source: None
ar: لا شيء

# selectDoctorHint
source: Select Doctor
ar: اختر الدكتور

# doctorLoadError
source: Error loading doctors: {error}
ar: خطأ في تحميل الأطباء: {error}

# refillReminderOff
source: Off
ar: إيقاف

# refillReminderDaysBefore
source: {days} days before
ar: قبل {days} أيام

# sideEffectsLabel
source: Known Side Effects
ar: الآثار الجانبية المعروفة

# addSideEffectHint
source: Add side effect (e.g. Drowsiness)
ar: أضف أثر جانبي (مثال: النعاس)

# notesHint
source: Add notes...
ar: أضف ملاحظات...

# addMedicineButton
source: Add Medicine
ar: إضافة الدواء

# updateMedicineButton
source: Update Medicine
ar: تحديث الدواء

# addMedicineImageTitle
source: Add Medicine Image
ar: إضافة صورة الدواء

source: Choose image source
ar: اختر مصدر الصورة

# captureFailed
source: Failed to capture image: {error}
ar: فشل التقاط الصورة: {error}

# pickFailed
source: Failed to pick image: {error}
ar: فشل اختيار الصورة: {error}

source: Extracted: {text}
ar: تم استخراج: {text}

# extractFailed
source: Could not extract text. Please enter details manually.
ar: تعذر استخراج النص. يرجى إدخال التفاصيل يدوياً.

# extractionError
source: Text extraction failed. Please enter manually.
ar: فشل استخراج النص. يرجى الإدخال يدوياً.

# medicineAutoName
source: Medicine ({form}) - {time}
ar: دواء ({form}) - {time}

# tabletForm
source: Tablet
ar: قرص

# capsuleForm
source: Capsule
ar: كبسولة

# liquidForm
source: Liquid
ar: سائل

# injectionForm
source: Injection
ar: حقنة

# dailyFrequency
source: Daily
ar: يومياً

# twiceDailyFrequency
source: Twice Daily
ar: مرتين يومياً

# threeTimesDailyFrequency
source: Three Times Daily
ar: 3 مرات يومياً

# weeklyFrequency
source: Weekly
ar: أسبوعياً

# asNeededFrequency
source: As Needed
ar: عند الحاجة

source: Select Language
ar: اختر اللغة

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

source: Theme
ar: المظهر

source: Dark Mode
ar: الوضع الداكن

source: Light Mode
ar: الوضع الفاتح

source: AI Health Assistant
ar: الم مساعد صحي ذكي

# typeMessage
source: Type a message...
ar: اكتب رسالة...

source: Analyze
ar: تحليل

source: Symptoms
ar: الأعراض

source: Medicines
ar: الأدوية

source: Add Medicine
ar: إضافة دواء

source: Save
ar: حفظ

source: Cancel
ar: إلغاء

# aiEnrichmentInProgress
source: AI is gathering medicine details...
ar: الذكاء الاصطناعي يجمع تفاصيل الدواء...

# aiEnrichmentSuccess
source: Medicine details enriched by AI!
ar: تم إثراء تفاصيل الدواء بواسطة الذكاء الاصطناعي!

# commonUsesLabel
source: Common Uses:
ar: الاستخدامات الشائعة:

# mealBreakfast
source: Breakfast
ar: الإفطار

# mealLunch
source: Lunch
ar: الغداء

# mealDinner
source: Dinner
ar: العشاء

# mealSnack
source: Snack
ar: وجبة خفيفة

source: Notification Settings
ar: إعدادات الإشعارات

# privacyPolicyTitle
source: Privacy Policy
ar: سياسة الخصوصية
