Repository: AmirmLotfy/Tickdose
Catalog: lib/l10n/app_*.arb
Languages: ar

source: No doctors found
ar: لم يتم العثور على أطباء

source: Error loading patients
ar: خطأ في تحميل المرضى

# patientsWillAppearHere
source: Patients will appear here when they grant you access as their caregiver
ar: سيظهر المرضى هنا عندما يمنحونك الوصول كمقدم رعاية

source: How are you feeling?
ar: كيف تشعر؟

# describeSymptomsByVoiceOrText
source: Describe your symptoms by voice or text
ar: صف أعراضك بالصوت أو النص

source: Account deleted successfully
ar: تم حذف الحساب بنجاح

source: Incorrect password
ar: كلمة مرور غير صحيحة

# pleaseLogInAgainBeforeDeletingAccount
source: Please log out and log in again before deleting account
ar: يرجى تسجيل الخروج وتسجيل الدخول مرة أخرى قبل حذف الحساب

# genericNameLabel
source: Generic Name:
ar: الاسم العام:

# translationLabel
source: [Translation]
ar: [ترجمة]

source: Could not make call
ar: تعذر إجراء المكالمة

# resetSettingsTitle
source: Reset Settings
ar: إعادة تعيين الإعدادات

# resetSettingsConfirmation
source: Are you sure you want to reset all voice settings to defaults?
ar: هل أنت متأكد أنك تريد إعادة تعيين جميع إعدادات الصوت إلى القيم الافتراضية؟

source: Settings reset to defaults
ar: تم إعادة تعيين الإعدادات إلى القيم الافتراضية

# resetButton
source: Reset
ar: إعادة تعيين
